{
  "id": "FilesLesson1",
  "title": "Основы работы с папками",
  "steps": [
    {
      "title": "Шаг 1: Что такое папка?",
      "description": "Папка — это специальный контейнер для хранения файлов и других папок. Представьте её как бумажную папку в офисе, где хранятся документы на одну тему. Папки позволяют группировать связанные файлы вместе.",
      "hint": "💡 Внутри папок могут быть другие папки — это создаёт иерархическую структуру, как ветки дерева."
    },
    {
      "title": "Шаг 2: Зачем нужны папки?",
      "description": "Папки помогают организовать файлы логично и удобно:\n• Документы отдельно\n• Фотографии отдельно\n• Музыка отдельно\n• Рабочие файлы отдельно от личных",
      "hint": "💡 Хорошая организация папок экономит время при поиске файлов и повышает продуктивность."
    },
    {
      "title": "Шаг 3: Как выглядят папки?",
      "description": "Папки в Windows выглядят как жёлтые иконки с изображением открывающейся папки. Название папки пишется под иконкой синим или чёрным цветом.",
      "hint": "💡 Цвет папки может меняться в зависимости от темы Windows или пользовательских настроек."
    },
    {
      "title": "Шаг 4: Поиск места для новой папки",
      "description": "Найдите пустое место на рабочем столе — область без значков и открытых окон. Убедитесь, что вокруг достаточно места для нового значка папки.",
      "hint": "💡 Лучше создавать папки в видимых местах, чтобы не терять их среди других элементов."
    },
    {
      "title": "Шаг 5: Открытие контекстного меню",
      "description": "Щёлкните правой кнопкой мыши (ПКМ) по пустому месту на рабочем столе. Появится контекстное меню — список доступных действий для выбранной области, таких как создание элементов, сортировка или свойства.",
      "hint": "💡 Правая кнопка мыши всегда открывает контекстное меню действий для выбранного элемента."
    },
    {
      "title": "Шаг 6: Выбор пункта 'Создать'",
      "description": "В открывшемся контекстном меню наведите курсор на пункт 'Создать'. Откроется дополнительное подменю с вариантами того, что можно создать: папку, документ, ярлык и другие элементы.",
      "hint": "💡 Убедитесь, что курсор чётко указывает на 'Создать' перед тем, как откроется подменю."
    },
    {
      "title": "Шаг 7: Выбор 'Папка' в подменю",
      "description": "В подменю 'Создать' нажмите на пункт 'Папка'. Это команда для создания новой пустой папки на рабочем столе.",
      "hint": "💡 Если меню случайно закрылось, просто повторите правый клик в том же месте."
    },
    {
      "title": "Шаг 8: Проверка создания папки",
      "description": "На рабочем столе появится новая папка с названием 'Новая папка'. Название будет выделено синим цветом и готово к редактированию.",
      "hint": "💡 Папка создана успешно, если вы видите иконку папки и мигающий курсор в названии."
    }
  ],
  "completionMessage": "Поздравляем с завершением урока! Вы освоили создание и наименование папок в Windows."
}
