{
  "id": "FilesLesson2",
  "title": "Работа с корзиной",
  "steps": [
    {
      "title": "Шаг 1: Найдите созданную папку",
      "description": "Посмотрите на рабочий стол и найдите папку, которую вы создали в предыдущем уроке. Это может быть 'Новая папка' или папка с вашим именем.",
      "hint": "💡 Если папок много, ищите жёлтую иконку папки с знакомым названием."
    },
    {
      "title": "Шаг 2: Выделите папку",
      "description": "Наведите курсор мыши на созданную папку и щёлкните один раз левой кнопкой мыши. Папка должна выделиться синим или серым цветом.",
      "hint": "💡 Убедитесь, что именно эта папка выделена рамкой."
    },
    {
      "title": "Шаг 3: Откройте контекстное меню",
      "description": "Щёлкните правой кнопкой мыши по выделенной папке. Появится контекстное меню со списком действий.",
      "hint": "💡 Правая кнопка мыши открывает меню именно для выбранного элемента."
    },
    {
      "title": "Шаг 4: Выберите 'Удалить'",
      "description": "В контекстном меню найдите и нажмите пункт 'Удалить'. Папка будет перемещена в корзину.",
      "hint": "💡 Папка не удаляется навсегда — она просто перемещается в корзину."
    },
    {
      "title": "Шаг 5: Проверьте, что папки нет",
      "description": "Посмотрите на рабочий стол — папка должна исчезнуть. Теперь она находится в корзине.",
      "hint": "💡 Если папка всё ещё видна, повторите шаги 2-5."
    },
    {
      "title": "Шаг 6: Найдите корзину",
      "description": "Посмотрите на рабочий стол и найдите значок корзины. Он выглядит как мусорное ведро.",
      "hint": "💡 Корзина обычно находится в правой части рабочего стола."
    },
    {
      "title": "Шаг 7: Откройте корзину",
      "description": "Дважды щёлкните левой кнопкой мыши по значку корзины. Откроется окно с содержимым корзины.",
      "hint": "💡 Двойной клик открывает корзину, одинарный — только выделяет значок."
    },
    {
      "title": "Шаг 8: Найдите удалённую папку",
      "description": "В окне корзины найдите вашу удалённую папку.",
      "hint": "💡 Папка показывает дату и время удаления."
    },
    {
      "title": "Шаг 9: Выделите папку в корзине",
      "description": "Щёлкните один раз левой кнопкой мыши по удалённой папке в корзине. Она должна выделиться.",
      "hint": "💡 Убедитесь, что выделили именно нужную папку."
    },
    {
      "title": "Шаг 10: Откройте контекстное меню в корзине",
      "description": "Щёлкните правой кнопкой мыши по выделенной папке в корзине. Появится контекстное меню.",
      "hint": "💡 Меню в корзине немного отличается от меню на рабочем столе."
    },
    {
      "title": "Шаг 11: Выберите 'Восстановить'",
      "description": "В контекстном меню нажмите пункт 'Восстановить'. Папка вернётся на рабочий стол.",
      "hint": "💡 Папка восстановится точно туда, откуда была удалена."
    },
    {
      "title": "Шаг 12: Проверьте восстановление",
      "description": "Закройте окно корзины и посмотрите на рабочий стол. Папка должна снова появиться.",
      "hint": "💡 Если папки нет, откройте корзину ещё раз и повторите восстановление."
    },
    {
      "title": "Шаг 13: Окончательно удалите папку",
      "description": "Снова удалите свою папку. Теперь мы её очистим окончательно.",
      "hint": "💡 Удалите ту же папку, которую только что восстановили."
    },
    {
      "title": "Шаг 14: Откройте корзину снова",
      "description": "Дважды щёлкните по значку корзины на рабочем столе. Ваша папка снова должна быть внутри.",
      "hint": "💡 Иконка корзины теперь выглядит заполненной."
    },
    {
      "title": "Шаг 15: Очистите всю корзину",
      "description": "В окне корзины нажмите кнопку 'Очистить корзину' на верхней панели. Появится окно подтверждения.",
      "hint": "💡 Эта кнопка удаляет ВСЕ файлы из корзины."
    },
    {
      "title": "Шаг 16: Подтвердите очистку",
      "description": "В окне подтверждения прочитайте сообщение и нажмите 'Да'. Все файлы из корзины удалятся навсегда.",
      "hint": "💡 После этого восстановить файлы стандартными средствами нельзя."
    },
    {
      "title": "Шаг 17: Проверьте результат",
      "description": "Корзина теперь пуста. Иконка корзины на рабочем столе снова выглядит как пустое ведро.",
      "hint": "💡 Файлы из корзины больше не занимают место на диске."
    }
  ],
  "completionMessage": "Отлично! Вы освоили полную работу с корзиной: удаление, восстановление и окончательную очистку."
}
